app/views/jobs/show.html.erb

                          <%= link_to (user_path(c.user.id)) do %>
                              <strong><%= c.user.first_name %></strong>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]