app/views/users/show.html.erb

                  <table class="table">
                    <% if @user.experiences.exists? %>
---
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."user_id" = $1 ORDER BY "experiences"."id" DESC LIMIT $2  [["user_id", 9], ["LIMIT", 1]]