app/views/experiences/new.html.erb

              <%= f.label :jobtype_id, 'Job description' %>:
              <%= f.collection_select(:jobtype_id, Jobtype.all, :id, :name) %>
---
SELECT "jobtypes".* FROM "jobtypes"