app/controllers/applications_controller.rb

  def create
    @application = Application.new
    @application.job_id = params[:job_id]
    @application.user = current_user
    @application.status = "active"

    if @application.save
---
INSERT INTO "applications" ("job_id", "user_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["job_id", 1], ["user_id", 9], ["status", "active"], ["created_at", "2017-07-20 19:06:46.512575"], ["updated_at", "2017-07-20 19:06:46.512575"]]

  def index
    if current_user.usertype_id == 1
      redirect_to '/jobs'
    else
      @application = Application.all
      @userapps = @application.where({user_id: current_user.id, status: 'active'})
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "applications".* FROM "applications" WHERE "applications"."user_id" = $1 AND "applications"."status" = $2  [["user_id", 12], ["status", "active"]]