app/controllers/experiences_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def new
    @user = User.find(params[:id])

INSERT INTO "experiences" ("user_id", "jobtype_id", "employer_name", "months", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 9], ["jobtype_id", 1], ["employer_name", "dsfa"], ["months", 24], ["description", "dnvdlfas"]]
---
  def create
    @experience = Experience.new(experience_params)
    @experience.user = current_user

    if @experience.save