app/controllers/users_controller.rb

SELECT  "usertypes".* FROM "usertypes" WHERE "usertypes"."name" = $1 ORDER BY "usertypes"."id" ASC LIMIT $2  [["name", "restaurant"], ["LIMIT", 1]]
---
  def restaurant
    @user = User.new
    @usertype = Usertype.where(name: "restaurant").first

SELECT  "usertypes".* FROM "usertypes" WHERE "usertypes"."name" = $1 ORDER BY "usertypes"."id" ASC LIMIT $2  [["name", "worker"], ["LIMIT", 1]]
---
  def worker
    @usertype = Usertype.where(name: "worker").first

INSERT INTO "users" ("email", "password_digest", "cell", "first_name", "last_name", "restaurant_name", "street_address", "city", "province", "postal_code", "created_at", "updated_at", "usertype_id", "longitude", "latitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ffrancois@gmail.com"], ["LIMIT", 1]]
---
  def create
    user = User.new(user_params)

    if user.save
      session[:users_id] = user.id
      redirect_to '/login'
      flash[:success] = "Login to complete your registration process"

    else
      if User.find_by(email: user.email)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    if !current_user
      redirect_to '/login'
    else
    @user = User.find(params[:id])